VPro/src/Catalogs/PlanningPeriods/PlanningPeriods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PlanningPeriods</name>
  <predefined>
    <items>
      <name>Actual</name>
      <description>Kỳ thực tế</description>
    </items>
  </predefined>
  <attributes>
    <name>StartDate</name>
    <comment>Start date</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <comment>End date</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Periodicity</name>
    <type>
      <types>EnumRef.Periodicity</types>
    </type>
  </attributes>
</mdclass:Catalog>

VPro/src/Catalogs/PlanningPeriods/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure - event handler FillCheckProcessing object.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If (NOT IsFolder) AND ValueIsFilled(StartDate)
		AND ValueIsFilled(EndDate) Then
		
		If StartDate > EndDate Then
			
			Message = New UserMessage;
			Message.Text = NStr("en='The Start date field value is greater than the End date field value.';ru='Значение поля ""Дата начала"" больше значения поля ""Дата окончания""';vi='Giá trị trường ""Ngày bắt đầu"" lớn hơn giá trị trường ""Ngày kết thúc""'");
			Message.Field = "Object.StartDate";
			Message.Message();
			
			Cancel = True;
			
		EndIf;
		
	EndIf;
	
	If (NOT IsFolder) AND (Ref = Catalogs.PlanningPeriods.Actual) Then
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "StartDate");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "EndDate");
		
	EndIf;
	
EndProcedure // FillCheckProcessing()

#EndRegion

#EndIf
